config.org
#+TITLE: Work Emacs Config
#+AUTHOR: Ultrafeeder4
#+DESCRIPTION: Emacs config for work.
#+STARTUP: showeverything
#+OPTIONS: toc:2


* TABLE OF CONTENTS :toc:
- [[#important-programs-to-load-first][IMPORTANT PROGRAMS TO LOAD FIRST]]
  - [[#elpaca-package-manager][Elpaca Package Manager]]
  - [[#script-sourcing][Script Sourcing]]
  - [[#load-evil-mode][Load Evil Mode]]
  - [[#general-keybindings][General Keybindings]]
- [[#all-the-icons][ALL THE ICONS]]
- [[#backup][BACKUP]]
- [[#company][COMPANY]]
- [[#dashboard][DASHBOARD]]
- [[#diminish][DIMINISH]]
- [[#dired][DIRED]]
- [[#elfeed][ELFEED]]
- [[#flycheck][FLYCHECK]]
- [[#fonts][FONTS]]
  - [[#setting-the-font-face][Setting the Font Face]]
  - [[#global-zoom-inout][Global Zoom In/Out]]
- [[#graphical-user-interface-tweaks][GRAPHICAL USER INTERFACE TWEAKS]]
  - [[#disable-menubar-toolbars-and-scrollbars][Disable Menubar, toolbars and Scrollbars]]
  - [[#display-line-numbers-and-truncated-lines][Display Line Numbers and Truncated Lines]]
  - [[#disable-startup-screen][Disable startup screen]]
  - [[#themescolors][Themes/Colors]]
  - [[#display-colors-in-code-blocks][Display colors in code blocks]]
  - [[#display-colored-delimiters][Display Colored Delimiters]]
- [[#git][GIT]]
  - [[#git-time-machine][Git Time Machine]]
  - [[#magit][Magit]]
- [[#ivy-counsel][IVY (COUNSEL)]]
- [[#language-supportlsp][LANGUAGE SUPPORT/LSP]]
  - [[#lua][Lua]]
  - [[#tbd][Tbd]]
- [[#modeline][MODELINE]]
- [[#neotree][NEOTREE]]
- [[#org-mode][ORG MODE]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#enabling-org-bullets][Enabling Org Bullets]]
  - [[#qol-enhancements-in-org-mode][QOL Enhancements in Org mode]]
  - [[#enable-tempo-shortcuts][Enable tempo shortcuts]]
- [[#projectile][PROJECTILE]]
- [[#reload-emacs][RELOAD EMACS]]
  - [[#define-interactive-function-that-reloads-initel-file][Define interactive function that reloads init.el file]]
- [[#shells-and-terminals][SHELLS AND TERMINALS]]
  - [[#eshell][Eshell]]
  - [[#pwsh][Pwsh]]
- [[#which-key][WHICH-KEY]]

* IMPORTANT PROGRAMS TO LOAD FIRST

** Elpaca Package Manager

Sourcing the scripts that contain package definitions/configurations as well as automatically ensuring that all future packages are installed by defualt unless specified otherwise.

#+begin_src emacs-lisp
  (setq use-package-always-ensure t)
  (add-to-list 'load-path "~\\.emacs.d\\scripts\\")
#+end_src

** Script Sourcing
#+begin_src emacs-lisp
  (require 'elpaca-setup)
  (require 'buffer-move)
#+end_src

** Load Evil Mode

#+begin_src emacs-lisp
      (use-package evil
            :init
            (setq evil-want-integration t)
            (setq evil-want-keybinding nil)
            (setq evil-vsplit-window-right t)
            (setq evil-split-window-below t)
            (evil-mode ))
      (use-package evil-collection
        :after evil
        :config
        (setq evil-collection-mode-list '(dashboard dired ibuffer))
        (evil-collection-init))
      (use-package evil-tutor

)

          ;;Turns off elpaca-use-package-mode current declaration
          ;;Note this will cause evaluate the declaration immediately. It is not deferred.
          ;;Useful for configuring built-in emacs features.
          (use-package emacs :ensure nil :config (setq ring-bell-function #'ignore))
  ;; Don't install anything. Defer execution of BODY
  (with-eval-after-load 'evil-maps
    (define-key evil-motion-state-map (kbd "SPC") nil)
    (define-key evil-motion-state-map (kbd "RET") nil)
    (define-key evil-motion-state-map (kbd "TAB") nil))
  (setq org-return-follows-link t)
          
#+end_src

