config.org
* DIRED
#+begin_src emacs-lisp
(use-package dired-open
  :config
  (setq dired-open-extensions '(("gif" . "sxiv")
                                ("jpg" . "sxiv")
                                ("png" . "sxiv")
                                ("mkv" . "mpv")
                                ("mp4" . "mpv"))))

(use-package peep-dired
  :after dired
  :hook (evil-normalize-keymaps . peep-dired-hook)
  :config
    (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
    (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
    (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
    (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file)
)
#+end_src

* ELFEED
#+begin_src emacs-lisp
    (use-package elfeed
      :config
      (setq elfeed-search-feed-face ":foreground #ffffff :weight bold"
            elfeed-feeds (quote
                           (("https://www.reddit.com/r/linux.rss" reddit linux)
                            ("https://www.reddit.com/r/commandline.rss" reddit commandline)
                            ("https://www.reddit.com/r/distrotube.rss" reddit distrotube)
                            ("https://www.reddit.com/r/emacs.rss" reddit emacs)
                            ("https://www.gamingonlinux.com/article_rss.php" gaming linux)
                            ("https://hackaday.com/blog/feed/" hackaday linux)
                            ("https://opensource.com/feed" opensource linux)
                            ("https://linux.softpedia.com/backend.xml" softpedia linux)
                            ("https://itsfoss.com/feed/" itsfoss linux)
                            ("https://www.zdnet.com/topic/linux/rss.xml" zdnet linux)
                            ("https://www.phoronix.com/rss.php" phoronix linux)
                            ("http://feeds.feedburner.com/d0od" omgubuntu linux)
                            ("https://www.computerworld.com/index.rss" computerworld linux)
                            ("https://www.networkworld.com/category/linux/index.rss" networkworld linux)
                            ("https://www.techrepublic.com/rssfeeds/topic/open-source/" techrepublic linux)
                            ("https://betanews.com/feed" betanews linux)
                            ("http://lxer.com/module/newswire/headlines.rss" lxer linux)
                            ("https://distrowatch.com/news/dwd.xml" distrowatch linux)))))

    (use-package elfeed-goodies
      :init
      (elfeed-goodies/setup)
      :config
      (setq elfeed-goodies/entry-pane-size 0.5))
#+end_src
* FLYCHECK

#+begin_src emacs-lisp
  (use-package flycheck
    :defer t
    :diminish
    :init (global-flycheck-mode))
#+end_src

* FONTS

** Setting the Font Face

#+begin_src emacs-lisp
  (set-face-attribute 'default nil
    :family "BigBlueTerm437 Nerd Font Mono"
    :height 110
    :weight 'medium)
  (set-face-attribute 'variable-pitch nil
    :family "BigBlueTerm437 Nerd Font Mono"
    :height 120
    :weight 'medium)
  (set-face-attribute 'fixed-pitch nil
    :family "BigBlueTerm437 Nerd Font Mono"
    :height 110
    :weight 'medium)
  ;; Makes commented text and keywords italics.
  ;; This is working in emacsclient but not emacs.
  ;; Your font must have an italic face available.
  (set-face-attribute 'font-lock-comment-face nil
    :slant 'italic)
  (set-face-attribute 'font-lock-keyword-face nil
    :slant 'italic)

  ;; This sets the default font on all graphical frames created after restarting Emacs.
  ;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
  ;; are not right unless I also add this method of setting the default font.
  (add-to-list 'default-frame-alist '(font . "BigBlueTerm437 Nerd Font Mono"))

  ;; Uncomment the following line if line spacing needs adjusting.
  (setq-default line-spacing 0.12)
#+end_src

** Global Zoom In/Out
#+begin_src emacs-lisp
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)
(global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
(global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
#+end_src
R
* GRAPHICAL USER INTERFACE TWEAKS

** Disable Menubar, toolbars and Scrollbars

#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

** Display Line Numbers and Truncated Lines
#+begin_src emacs-lisp
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
#+end_src

** Disable startup screen
#+begin_src emacs-lisp
  (setq inhibit-startup-screen t)
#+end_src
** Themes/Colors
#+begin_src emacs-lisp
  (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/")
  (use-package doom-themes
  :custom
  (doom-themes-enable-bold t )   ; if nil, bold is universally disabled
      (doom-themes-enable-italic t)
      :config
  (load-theme 'doom-sourcerer t)
  )  ;
#+end_src

** Display colors in code blocks
#+begin_src emacs-lisp
  (use-package rainbow-mode
    :diminish
    :hook org-mode prog-mode)
#+end_src
** Display Colored Delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook ((emacs-lisp-mode . rainbow-delimiters-mode)
  	 (clojure-mode . rainbow-delimiters-mode)))
#+end_src

* GIT 
** Git Time Machine
#+begin_src emacs-lisp
  (use-package git-timemachine
    :after git-timemachine
    :hook (evil-normalize-keymaps . git-timemachine-hook)
    :config
    (evil-define-key 'normal git-timemachine-mode-map (kbd "C-j") 'git-timemachine-show-previous-revision)
    (evil-define-key 'normal git-timemachine-mode-map (kbd "C-k") 'git-timemachine-show-next-revision)
)
#+end_src

** Magit
#+begin_src emacs-lisp
(use-package transient)
(use-package magit :after transient)
#+end_src

* IVY (COUNSEL)

#+begin_src emacs-lisp
        (use-package counsel
  	:diminish
          :after ivy
          :config (counsel-mode))
      (use-package ivy
        :diminish
        :bind
        (("C-c C-r" . ivy-resume)
         ("C-x B" . ivy-switch-buffer-other-window))
        :custom
    (setq ivy-use-virtual-buffers t)
    (setq ivy-count-format "(%d/%d) ")
    (setq enable-recursive-minibuffers t)
    :config
  (ivy-mode))
  (use-package nerd-icons-ivy-rich
    :diminish
    :init (nerd-icons-ivy-rich-mode 1))
  (use-package ivy-rich
    :diminish
    :after ivy
    :init (ivy-rich-mode 1)
    :custom
    (ivy-virtual-abbreviate 'full
  			  ivy-rich-switch-buffer-align-virtual-buffer t
  			  ivy-rich-path-style 'abbrev)
    :config
    (ivy-set-display-transformer 'ivy-switch-buffer
  			       'ivy-rich-switch-buffer-transformer))
#+end_src

* LANGUAGE SUPPORT/LSP

** Lua
#+begin_src emacs-lisp
(use-package lua-mode)
#+end_src

** Tbd

* MODELINE
#+begin_src emacs-lisp
  (use-package doom-modeline
  	      :init (doom-modeline-mode 1)
  	      :config
  	      (setq doom-modeline-height 20
  		    doom-modeline-bar-width 5
  		    doom-modeline-persp-name t
  		    doom-modeline-persp-icon t))
#+end_src
* NEOTREE
#+begin_src emacs-lisp
(use-package neotree
  :config
  (setq neo-smart-open t
        neo-show-hidden-files t
        neo-window-width 55
        neo-window-fixed-size nil
        inhibit-compacting-font-caches 
t
        projectile-switch-project-action 'neotree-projectile-action) 
        ;; truncate long file names in neotree
        (add-hook 'neo-after-create-hook
           #'(lambda (_)
               (with-current-buffer (get-buffer neo-buffer-name)
                 (setq truncate-lines t)
                 (setq word-wrap nil)
                 (make-local-variable 'auto-hscroll-mode)
                 (setq auto-hscroll-mode nil))))
(evil-define-key 'normal neotree-mode-map (kbd "TAB") 'neotree-enter)
    (evil-define-key 'normal neotree-mode-map (kbd "SPC") 'neotree-quick-look)
    (evil-define-key 'normal neotree-mode-map (kbd "q") 'neotree-hide)
    (evil-define-key 'normal neotree-mode-map (kbd "RET") 'neotree-enter)
    (evil-define-key 'normal neotree-mode-map (kbd "g") 'neotree-refresh)
    (evil-define-key 'normal neotree-mode-map (kbd "j") 'neotree-next-line)
    (evil-define-key 'normal neotree-mode-map (kbd "k") 'neotree-previous-line)
    (evil-define-key 'normal neotree-mode-map (kbd "A") 'neotree-stretch-toggle)
    (evil-define-key 'normal neotree-mode-map (kbd "H") 'neotree-hidden-file-toggle)
(evil-define-key 'insert neotree-mode-map (kbd "j") 'neotree-next-line)
    (evil-define-key 'insert neotree-mode-map (kbd "k") 'neotree-previous-line)
)
#+end_src
* ORG MODE

** Enabling Table of Contents

#+begin_src emacs-lisp
  (use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Enabling Org Bullets

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

** QOL Enhancements in Org mode
#+begin_src emacs-lisp
(electric-indent-mode -1)
(electric-pair-mode 1)
(add-hook 'org-mode-hook (lambda ()
			   (setq-local electric-pair-inhibit-predicate
				       '(lambda (c)
					  (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
(global-auto-revert-mode t)
(setq org-edit-src-content-indentation 0)
(global-set-key [escape] 'keyboard-escape-quit)
#+end_src 

** Enable tempo shortcuts

#+begin_src emacs-lisp 
  (require 'org-tempo)
#+end_src

* PROJECTILE

#+begin_src emacs-lisp
(use-package projectile
  :config
  (projectile-mode 1))
#+end_src

* RELOAD EMACS

** Define interactive function that reloads init.el file
#+begin_src emacs-lisp
  (defun reload-init-file ()
    (interactive)
    (load-file user-init-file)
    (load-file user-init-file))
#+end_src

* SHELLS AND TERMINALS

